Autodesk.Revit.DB.BuiltInFailures.KeynoteFailures.NotAssociatedKeynoteParameter
Current tag keynoting system uses key value parameter that is not associated with this element category.\nTo resolve,
associate parameter with category or change keynoting system.

Autodesk.Revit.DB.BuiltInFailures.KeynoteFailures.MissKeynotingSystem
No Keynoting System associated with Tag Family.\nTo resolve, select keynoting system for the tag family.

Autodesk.Revit.DB.BuiltInFailures.KeynoteFailures.MissKeynoteParameter
No Keynote Parameter.\nTo resolve, select key value parameter in keynoting system.